benchmarks/eplb_rebalance/results/serving_nixl_20260912_sage_optin/random_async_off/bench.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f70cf0c5800>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=200, random_output_len=300, random_range_ratio='0.0', random_prefix_len=300, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='Qwen/Qwen3-30B-A3B-Instruct-2507', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/cc/vllm-ilp/benchmarks/eplb_rebalance/results/serving_nixl_20260912_sage_optin/random_async_off', result_filename='bench.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,e2el', metric_percentiles='50,99', goodput=None, request_id_prefix='bench-3064ae8e-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-11 17:37:19 [utils.py:90] Sampling input_len from [200, 200] and output_len from [300, 300]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  4713.57   
Total input tokens:                      250000    
Total generated tokens:                  150000    
Request throughput (req/s):              0.11      
Output token throughput (tok/s):         31.82     
Peak output token throughput (tok/s):    64.00     
Peak concurrent requests:                50.00     
Total token throughput (tok/s):          84.86     
---------------Time to First Token----------------
Mean TTFT (ms):                          49863.71  
Median TTFT (ms):                        49074.58  
P50 TTFT (ms):                           49074.58  
P99 TTFT (ms):                           75020.78  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          823.48    
Median TPOT (ms):                        809.01    
P50 TPOT (ms):                           809.01    
P99 TPOT (ms):                           997.49    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          296083.77 
Median E2EL (ms):                        299993.28 
P50 E2EL (ms):                           299993.28 
P99 E2EL (ms):                           324468.47 
==================================================